Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70Q21.PIC
      <edc:AdjustPoint edc:_addr="0x40064034" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x4006404C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC1_OVER" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:desc="Overrun Error 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:desc="Overrun Error 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:desc="Overrun Error 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:desc="Overrun Error 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:desc="Overrun Error 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:desc="Overrun Error 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:desc="Overrun Error 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:desc="Overrun Error 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE8" edc:desc="Overrun Error 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE9" edc:desc="Overrun Error 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE10" edc:desc="Overrun Error 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE11" edc:desc="Overrun Error 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064050" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC1_CWR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:desc="Low Threshold" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:desc="High Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064054" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC1_CGR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GAIN0" edc:desc="Gain for Channel 0" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN1" edc:desc="Gain for Channel 1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN2" edc:desc="Gain for Channel 2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN3" edc:desc="Gain for Channel 3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN4" edc:desc="Gain for Channel 4" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN5" edc:desc="Gain for Channel 5" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN6" edc:desc="Gain for Channel 6" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN7" edc:desc="Gain for Channel 7" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN8" edc:desc="Gain for Channel 8" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN9" edc:desc="Gain for Channel 9" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN10" edc:desc="Gain for Channel 10" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN11" edc:desc="Gain for Channel 11" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40064058" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40064060" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC1_DIFFR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DIFF0" edc:desc="Differential inputs for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:desc="Differential inputs for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:desc="Differential inputs for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:desc="Differential inputs for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:desc="Differential inputs for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:desc="Differential inputs for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:desc="Differential inputs for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:desc="Differential inputs for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:desc="Differential inputs for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:desc="Differential inputs for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:desc="Differential inputs for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:desc="Differential inputs for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064064" edc:access="----------------------------nnnn" edc:cname="AFEC1_CSELR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Channel Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064068" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="AFEC1_CDR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Converted Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006406C" edc:access="----------------------nnnnnnnnnn" edc:cname="AFEC1_COCR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AOFF" edc:desc="Analog Offset" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064070" edc:access="--------------------------nn---n" edc:cname="AFEC1_TEMPMR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCT" edc:desc="Temperature Sensor RTC Trigger Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:desc="Temperature Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC1_TEMPCWR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:desc="Temperature Low Threshold" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:desc="Temperature High Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40064078" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40064094" edc:access="----------------------nn----nn--" edc:cname="AFEC1_ACR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:desc="PGA0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:desc="PGA1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:desc="AFE Bias Current Control" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40064098" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400640A0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC1_SHMR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:desc="Dual Sample &amp; Hold for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:desc="Dual Sample &amp; Hold for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:desc="Dual Sample &amp; Hold for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:desc="Dual Sample &amp; Hold for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:desc="Dual Sample &amp; Hold for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:desc="Dual Sample &amp; Hold for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:desc="Dual Sample &amp; Hold for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:desc="Dual Sample &amp; Hold for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:desc="Dual Sample &amp; Hold for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:desc="Dual Sample &amp; Hold for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:desc="Dual Sample &amp; Hold for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:desc="Dual Sample &amp; Hold for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
